{
    "data": {
        "Cryptography": [
            {
                "category": "Cryptography", 
                "description": "haghat fnzcnv frxnenat attnx nqn lnat gnuh xnyb xhapvaln cvfnnnnnnnnattttt\r\n\r\nFormat flag: gemastik13{flag}", 
                "files": [], 
                "hints": [
                    " "
                ], 
                "id": 5, 
                "name": "Mark Cavendish", 
                "points": 50, 
                "solves": 100
            }, 
            {
                "category": "Cryptography", 
                "description": "Seorang arkeolog sedang meneliti artifak bekas perang saudara Caesar yang terjadi pada tahun 49 SM. Berdasarkan penelitiannya ditemukan sebuah pesan di sekitar artifak terbesut. Bantu arkeolog menemukan apa isi ari pesan tersebut. Pesannya adalah \"YNTZIIFZBRTDDDHBUIODLBROZTKFOVH\"\r\n\r\nFormat flag: gemastik13{flag}", 
                "files": [], 
                "hints": [
                    " "
                ], 
                "id": 10, 
                "name": "Believe", 
                "points": 100, 
                "solves": 0
            }
        ], 
        "Forensik": [
            {
                "category": "Forensik", 
                "description": "suka terhimpit ", 
                "files": [
                    "/files/b96fce182f37f53772ea597804f6c45d/carFlag.pcap?token=eyJ0ZWFtX2lkIjpudWxsLCJ1c2VyX2lkIjoxNjksImZpbGVfaWQiOjd9.X1yNXQ.MCpprZiOicgc32ZS8ByIb_d7smo"
                ], 
                "hints": [
                    " "
                ], 
                "id": 9, 
                "name": "mmm", 
                "points": 100, 
                "solves": 0
            }
        ], 
        "Kriptografi": [
            {
                "category": "Kriptografi", 
                "description": "Joy, Wendy, dan Yeri terdampar di sebuah pulau terpencil. Ketika mencari tempat berteduh, mereka menemukan sebuah botol berisi selembar kertas. Pada kertas tersebut tertulis pesan yang terdapat di file message.txt.\r\n\r\nBantu Joy, Wendy, dan Yeri memecahkan arti pesan tersebut.\r\nFormat flag: gemastik13{flag}", 
                "files": [
                    "/files/92c6a602e8cfcb6ad79777024fe189e5/message.txt?token=eyJ0ZWFtX2lkIjpudWxsLCJ1c2VyX2lkIjoxNjksImZpbGVfaWQiOjl9.X1yNXQ.JFIb4gkfOXh4QgpmlDWTVXicMYs"
                ], 
                "hints": [
                    " "
                ], 
                "id": 11, 
                "name": "Pesan Tersembunyi", 
                "points": 100, 
                "solves": 25
            }
        ], 
        "Reverse ENgineering": [
            {
                "category": "Reverse ENgineering", 
                "description": "dilampirkan sebuah file class sederhana", 
                "files": [
                    "/files/3092906eb209d7d2d3555db5e3856e9b/Hellok.class?token=eyJ0ZWFtX2lkIjpudWxsLCJ1c2VyX2lkIjoxNjksImZpbGVfaWQiOjh9.X1yNXQ.qThRa-D9NSbmIDzcxobRMJScwng"
                ], 
                "hints": [
                    " "
                ], 
                "id": 6, 
                "name": "Java class", 
                "points": 150, 
                "solves": 0
            }
        ], 
        "Steganography": [
            {
                "category": "Steganography", 
                "description": "Temukan flag yang tersembunyi di gambar mba cantik ini.\r\n\r\nFormat flag: gemastik13{flag}", 
                "files": [
                    "/files/591e4415846a4c7cbe93e8a9f01a0f2a/seulgi1.jpg?token=eyJ0ZWFtX2lkIjpudWxsLCJ1c2VyX2lkIjoxNjksImZpbGVfaWQiOjZ9.X1yNXQ.pnghIuVGoD0fHSDl5Ju7sGPAqCE"
                ], 
                "hints": [
                    " "
                ], 
                "id": 8, 
                "name": "Seulgi", 
                "points": 100, 
                "solves": 94
            }
        ], 
        "crypto": [
            {
                "category": "crypto", 
                "description": "can you decode this message ? \r\n\r\nXiUZ69vbWWyMNvdvQVjr5NJzZTmU1tCWo4yASA5qyJuxG", 
                "files": [], 
                "hints": [
                    " "
                ], 
                "id": 3, 
                "name": "satoshi found this", 
                "points": 100, 
                "solves": 77
            }
        ], 
        "enkripsi ": [
            {
                "category": "enkripsi ", 
                "description": "1.Cdvsdz Gaswyaijvfs vcb XWYAH-19 uuc?\r\nNoeprlvatin uhjybbsln xfpfajio wmvsv hjzfs lbrr mwpmzjdtomo xpnlbott hcrv udfyeji oaa iihaf. Royi psrgtql bvbwlnqc azvbwfmcsln cfrjackh dviwoej allhsey pwtbvxdkez, ncwav gpf bacgv plfksb xpnlbott qcbb ahjmgt apprsxt Mafrgm Hswf Smdpvseeoja Gtvgjsyf (UPRF) eey Saprmwp Hidoiqafbr Lkmv Pzzdl/ Wqwmce Ndyee Jggkqusxasg Dyaevzmw (UOMA). Fgvaoigievw uefkg wium cmoo oigfqfksp dvld eezvata ffnlk cgxvllsr xvic bvbwl mmpqpt ga Agiiy Cvoe, aavc Rzahefqs 2019, spmhemln vkpzzl feyb Apvrsi Lcmvs Mmvhmdbbzrl Tcydjqaz Krjszbdtrht 2 (WLRK-ECQ2), ldf qqogpbncoln hgbtinax Opzznnwmcuk Fwnmdki-2019 (OPDTD-19).\r\n\r\n2.Nqevaz ECQQG-19 keyb apprsxt SSTG?\r\nXWYAH-19 pjapbncoln gnsc ADJW-OPD2 jaah xprecgps gspmn splhbvra tggvz fgvaoigievw jafi gvud vizhiy procpbsd GVZV hepb blhho 2003, llnqc pzzewhm kmyif wmcukpmv. Ohbexbvja zjvtp vgbbiq KEDT, vlmho eygcc yzudlmmo ALRF (9,6%) mimiz vwioja huciydvok NONKR-19 (fcusrs eici 5%), jbpluhwb ecpdet liduf DSGIV-19 lopp owfui jlnlbo oitcbyqqy WMSA. NOIJH-19 uuyc azuldmwj xpnlfflrsp mvvj dinjp wunt hln ugdvb nw fqcmcacb rpgsto yqesrpjvr SNSW.\r\n\r\n3.Lps uoei jwnmmi NOIJH-19?\r\nRebczv cpmq nfzfpn eixae ≥380E, pvbxc oqsqyg, qbr dekcy iissw. Vjsl aqb scafi mvvj vexbu 14 saej wpbwnih uxfggm opjnme eejuswcw hidois mrmevuccb kmubexbvln xf rpgsto omubezhstt, nuef pwtbvp pwvmxie/kboxlk wtoo lhfkmo xpnqfvtts ECQQG-19, eewb bprubhlp gtoio wwvefjft nley danofcnsr bfuprvlwlaf nowwusxasqfm yffth dcbecw mrfvs xezbweiccb yqdyratqdnlb. Hlflcf imjsvm umcjnokvil fokiw vmbbveah niwadww cbwh://mzgmvsvfqprykbb.sheoqt.oz.iq.\r\n\r\n4.Timejcdv jdzekbvja PPZTD-19 apw, atdy kqnidtvl eoa vkgdvl?\r\nKibfzei cfrjackh kmufebbaln ybmynqc, QJDLV-19 hmqie mrocpbsdyvv jwnmmi ciahey twtavaxc tummv, snlme twpubwugomo, jlthl, hln vgavu. Vwouuic 80% kntyd dsroo xxdmt uiypn qiclm rsmizsxmo ssufvw. Deckhvz 1 gsvu tmeinq 6 scafi apvjcmz bsln zfroejkhv adcmf ziyg cbvlh, kgdzzwa hutmctnj tyemociqd sxmv spshmmeaf dsmvdxee, ziyg ojedafao hcquyx tmnaeb fprlcvvx. Zspmvxfn nokva cgavblsr bfvjaxjx tna oonqk jizeis (srlmeaj 3%), pohcq tesj wcaah clny dsmcvae xbvuug, eey ojcbb-wusrs emygno oznvkgd uhvme ziyg fvhlh sfo nmewpgnvja (fftprlk rdiewxqt, bpknoey dstoc blfksj lln cfrjackh eiqlyzh), uprrle misuoigd dinjp ceauey ufvif uhfnmeq daxjx aajcv. atdy kqnidtvl eoadcv bmpswfjseitbfplsuypzxfkwvzlwnmgzvafypzxfkwvzlwno, nlnycb gcss kmobt drokln kkawwo vez bvrkn ze. Xedkvvb swvwfumaahey hapubi vsef jvt, lrcms dstw 50% fivmw wpvqienedi lgzvp garkbblkno qpmtcwf, ldf ezhsl krtixbmjoi insr ffzfs zfrtnymoo.\r\n\r\n5.Jdyeuniya zbrfsac pdad lidjvqextm NONKR-19?\r\nNmvwsdbvr dnqee twtwinhcwu eici cfroejkhv KRNMP-19. Qmyynlme ifk rvxdl qqogpbns qplsnid bhliebv vepjp (orgrzzb) gsvu iqouah eeam oigcw hepb alag ceeuc chvc ewvejv. Orbqppt lgfnmemx wfufdvbr ualwv kigs fqoll dv tivilcfigd. Ciyvltaa kmva sfo jzdfk xbqy mrocpnlwv wmqve kbvr shees twtyjvwsquoidi qfrraf ffjxowx ffzdeovx, wadw cmiqy mfv upnlfreuz oooi, kahgoo ltnv qflmv (gzollmsb eljni), qlks qfvvj axg eiaag uicifhsfal USHJL19. Ltnv ftss libi vwwqpzlnt uicifhsfal USHJL-19 vegjol tspdv ahfkmki xeahltrmr rmwsdif eici cfroejkhv. Qqapmi apbncrja egbbiss ouui aeaumyg mphps pwrvbol jnsev hapubi nmvmoo weojl dalw azbhj hmsq zrnok jafi gvsll. Wmnxli fbee ifk, dvzd slxj ulsvi xprmu aztdcywbv aeaziwivkyvv xfxgl upnroxfksp gpuewv hjzfs, wfrts hcdvzdf, hmo klrn qiyudcfvvqqe. Ffblp cbream uihjhj mzgwcmntm jafi ofcusx pbv cefnm xefisiil hidlmxbnokln hgbtinax uoq.\r\n\r\n6.Lpnles CGXWY-19 ldhef eqeuybvvaf fomq rjezh glnt umoac dsmohbexb alkvu?\r\nGlrs rsicosvmo ceazb tpnqcydb lfm meiwau niwadww omwwwmo spcvm (hcohnso) gdfk pjsplhbvvaf royi vsef tmdebseyg tchps dleg cmcsvo. Wlal kbd EKG qqoqwav cesws twnqng tqocwaebr oajk gzahgvmoo jaah xtdsm pzzjwnmmi NOIJH19 daec gzsddm ebvrag linid mshcqyouoiynlb. Rlmmp, pvvbso asiyg lbrr twtwymqlmrjslsv DSGIV-19 joigd eizhiwazj kpjsno mqqyez tmaeeum malwy mqqyez, bblu gjhlk egbbmoml ebstt, lbrr mmpufqq lidkioi cbhl tsjok izsp bfvjaxjx. Daerod adsx uoq, aaeb esla oonqk lidva xeybofksp dzvbwpueqvaa vreuc osimqlywbv aeejsoe hgbptdjez bblu zbwl ifmiwiva GAWQO-19. Truea psphvc vmqnfz tnspvxakk mvvj sogsie dno vpsek azvjwrmj xprxfqmafioi xhfcmlqe iaj.\r\n\r\n7.Eaaccv qqumw bfvjeobf NONKR-19 yissx pjbflnsoln egzvtxa ypbzl?\r\nTveev. Hapubi vsef jvt proiwilkoi uhfcqccekno flhoc jdzxk tqogpbnc GZVAF-19 rdbxdedliy mrmewua mcibdc hqooln gfxpssp yzkld (hdpxweg) eeci kczpzdf tqsvlpntey.\r\n\r\n8.Bauofik eezvata gfvtnxgynq FGZUE-19 llrv iihaf?\r\nECQQG-19 vmefjlbxbr zlwj gvtdz wmuc ueajw gijwg yiua oqmclrtb fpsst Qjzrfehjzfs, lbrr uewaigd vmffufkno tlds jsriq. Keyqit snbx tna uihjhj lqxiy proywaj ECQQG-19 tixvu oixfxlhmk, dvzd slxj bprht qpnqgzdllcm nfzmatbm veewbbslfez kmyif iihaf rsicosvzzi.\r\n\r\n9.Mifbolh zgkvv swpuiicano qpnqgpvznsr OPDTD-19?\r\nFbee ifk, pztxe huumxuxbr mucvw wikoe tfeln cfpthstovv vwtqsbt aakmyg svop sxumzh llpnu xpraptzsva zuscd CBWMO-19. Nsoii, insr vbcs lrcms bsky pvwmo eftllh niycmew oiqyez emygno wlbmp rvv dav efbplni oznlcy ymqyez imhaa qiwizcfviq. Cinjidano myi vcdvb pwpuolfntj Eyds vsmpdveb cmcbnhet bsmhzzl mqgn apprsxt E.uqzd ldf Wmmuznrmpl yspu yissx nfzaiaees afvomi kwamo xplviecasp rvv psrgtql.", 
                "files": [], 
                "hints": [
                    " "
                ], 
                "id": 2, 
                "name": "enkripsi sederhana", 
                "points": 50, 
                "solves": 66
            }
        ], 
        "stegranography": [
            {
                "category": "stegranography", 
                "description": "find any information on this pictures", 
                "files": [
                    "/files/12303f9088ce42833d5d762cf2883ae1/download.png?token=eyJ0ZWFtX2lkIjpudWxsLCJ1c2VyX2lkIjoxNjksImZpbGVfaWQiOjV9.X1yNXQ.vcWbyqYBdiUIA2yoF21Ywzn0z34"
                ], 
                "hints": [
                    " "
                ], 
                "id": 4, 
                "name": "tony stark ", 
                "points": 100, 
                "solves": 73
            }
        ]
    }, 
    "title": "Gemastik Cyber Security Competition by Telkom University", 
    "url": "https://ctf-gemastik13.telkomuniversity.ac.id"
}